OpenFOAM-v2112-AD/applications/discreteAdjointOpenFOAM/adjoint/piggyChtMultiRegionTopologySimpleCheckpointingFoam/conjugateHeatedSolid/constant/solid/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*energySource
{
    type            scalarSemiImplicitSource;
    active          true;

    scalarSemiImplicitSourceCoeffs
    {
        selectionMode   cellSet;
        cellSet         heat;
        volumeMode      absolute; //specific; //specific; //absolute
        injectionRateSuSp
        {
            h           (500 0); // q in [W]; Q [W/m^3]
        }
    }
}*/

// ************************************************************************* //

