OpenFOAM-v2112-AD/applications/discreteAdjointOpenFOAM/adjoint/piggyChtMultiRegionTopologySimpleCheckpointingFoam/conjugateHeatedSolid/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            ("libOpenFOAM.so" "libfieldFunctionObjects.so");

application     simpleFoam;

startFrom       startTime;

startTime         500;

stopAt          endTime;

endTime        1500;

deltaT          1;

writeControl    timeStep;

writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

profiling
{
    active      false;
    cpuInfo     false;
    memInfo     false;
    sysInfo     false;
}


functions
{
    //#includeFunc fieldMinMax(T,region=solid,log=true)    
    //#includeFunc patchAverage(T,name=front_and_back,region=solid,log=true)    
    //#includeFunc patchAverage(T,name=outlet,region=fluid,log=true)    
    //#includeFunc patchAverage(T,name=fluid_to_solid,region=fluid,log=true)    
}

/*functions
{
    cuttingPlane
    {
        type            surfaces;
        libs            ("libsampling.so");
        writeControl    writeTime;
        surfaceFormat   vtk;
        fields          (sens U);
        interpolationScheme cellPoint;
        surfaces
        (
            zNormal
            {
                type cuttingPlane;
                planeType pointAndNormal;
                pointAndNormalDict
                {
                    point   (2.5 2.5 0.5);
                    normal  (0 0 1);
                }
                interpolate true;
            }
        );
    }
    #include "runtimePostProcessing"
}*/


// ************************************************************************* //
