OpenFOAM-v2112-AD/applications/discreteAdjointOpenFOAM/adjoint/piggyChtMultiRegionTopologySimpleCheckpointingFoam/conjugateHeatedSolid/system/solid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

SDLS yes;

solvers
{
    "(h|hReverse)"
    {
        solver          GAMG;
        tolerance       1e-06;
        smoother        DIC; //DICGaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration on;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 256;
        mergeLevels     1;
        //minIter         5;
        maxIter         50;
        SDLS $SDLS;
    }

    
    /*"(h|hReverse)"
    {
        solver          PBiCGStab;
        preconditioner  DIC; //FDIC;
        tolerance       1e-6;
        //relTol          0.001;
        SDLS $SDLS;
    }*/
    
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    equations
    {
       h               0.9;
    }
}

// ************************************************************************* //
